rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars"], ["release_date", "1977-05-25 00:00:00.000000"], ["updated_at", "2018-10-07 21:27:50.217683"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def same_director
    @movie = Movie.find(params[:id])
    movie_director = @movie.director
    if movie_director.blank? then                     #sad path
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else                                              #happy path
      @movies = Movie.where(director: movie_director)